Предполагается, что в рамках данного задания ученики сами будут изучать документацию, как минимум используя функционал `tab` и `shift+tab` от Jupyter

1. Импортируйте библиотеку pandas 
2. Считайте файл `wage.csv` в DataFrame с названием `wage`. Используйте для этого функцию pd.read_csv()

`person_id` - идентификатор человека

`gender` - пол, 0 - женский, 1 - мужской

`wage` - заработная плата в рублях

In [6]:
import pandas as pd
wage = pd.read_csv('wage-1-ee13a6b1-605e-44fe-83a6-85d3d7a0b3ae-2873619c-9efe-44e2-932a-f6fed7be056b.csv')

3. Поменяйте колонку `gender` так, чтобы были записи `F` (female) и `M` (male) вместо 0 и 1

In [7]:


# Замена с помощью функции в apply
wage['gender'] = wage['gender'].apply(lambda x: 'male' if x == 1 else 'female')
wage['gender'].value_counts()

gender
male      508
female    498
Name: count, dtype: int64

4. Давайте посчитаем среднюю зарплату у мужчин и женщин. Для этого используйте метод `groupby` со следующим синтаксисом:

`dataframe.groupby(Название_колонки_для_группировки)[Перечисление_колонок_для_агрегации].функция_агрегации()`

In [8]:
wage.groupby('gender')['wage'].mean()

gender
female    40855.747261
male      46815.944005
Name: wage, dtype: float64

5. Теперь взглянем внимательнее на данные и обнаружим, что некоторые люди попали в выборку несколько раз. 
    1. Найдите таких людей. Подсказка: `value_counts()`
    0. Убедитесь, что записи по ним с одинаковым `wage`. Возможно, тут вам пригодится функция агрегации `nunique()`, отображающая количество разных значений
    0. Избавьтесь от повторяющихся значений. Подсказка: `drop_duplicates()`

In [21]:
wage['person_id'].value_counts().head(50)

person_id
17     2
16     2
15     2
14     2
13     2
12     2
0      1
669    1
671    1
670    1
668    1
673    1
667    1
666    1
665    1
664    1
663    1
662    1
661    1
660    1
672    1
677    1
674    1
675    1
676    1
658    1
678    1
679    1
680    1
681    1
682    1
683    1
684    1
685    1
686    1
687    1
659    1
655    1
657    1
656    1
629    1
630    1
631    1
632    1
633    1
634    1
635    1
636    1
637    1
638    1
Name: count, dtype: int64

In [27]:
wage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1006 entries, 0 to 1005
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  1006 non-null   int64
 1   gender     1006 non-null   object
 2   wage       1006 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 23.7+ KB

In [23]:
wage.query('person_id in (12,13,14,15,16,17)')

    person_id  gender           wage
12         12    male   23547.663281
13         12    male   23547.663281
14         13    male  273483.609236
15         13    male  273483.609236
16         14    male   13434.655493
17         14    male   13434.655493
18         15  female   68341.332163
19         15  female   68341.332163
20         16  female   35448.040878
21         16  female   35448.040878
22         17    male   20178.985060
23         17    male   20178.985060

In [15]:
wage['person_id'].nunique()

1000

In [14]:
wage['wage'].nunique()

1000

In [24]:
wage_unique = wage.drop_duplicates(subset=['person_id'])

6. Теперь посмотрим внимательнее на зарплаты
    1. Охарактеризуйте имеющиеся данные по зарплатам. Подсказка: `describe`
    1. Избавьтесь от бессмысленных значений

In [28]:
wage_unique.describe()

         person_id           wage
count  1000.000000    1000.000000
mean    499.500000   43694.227404
std     288.819436   55352.539343
min       0.000000 -287418.645743
25%     249.750000   14489.682367
50%     499.500000   27309.529498
75%     749.250000   52021.080258
max     999.000000  755320.874132

7. Давайте теперь посмотрим на зарплату с учетом бонуса. Для этого нам понадобится таблица `bonus.csv`. Считайте ее в переменную `bonus`. Заметьте, что она сохранена немного в другом формате, и вам понадобится уточнить параметр `sep` - разделитель записей. Сравните текущий файл с предыдущим и попробуйте решить проблему

8. Чтобы посчитать итоговую зарплату, нам нужно по каждому человеку знать и оклад, и премию. Для этого надо будет соединить (сджойнить) таблицы по `person_id`. Используйте для этого функцию `pd.merge`. Помните, что параметр `how` должен быть `'outer'`, чтобы сохранить те записи, что есть только в одной таблице. Результат запишите в новый dataframe `df`

9. Наконец, давайте посчитаем итоговую зарплату
    1. Замените отсутствующие записи в колонке `bonus` нулями
    1. Уберите людей без `wage` - это те "плохие" записи, от которых мы избавлялись на предыдущих шагах
    1. Сделайте новую колонку `total`, которая будет равна 12 окладам и премии
    1. Посчитайте среднюю и медианную итоговую зарплату в разрезе по полу. Подсказка: вместо функции агрегации можно написать `.agg()` и перечислить внутри нужные агрегаты

10. Сохраните `df` в файл, используя метод `to_csv()`. Не записывайте индексы